// #1 Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
console.log("!!!Перша задача!!!");
let number = 0;


while (number < 10) {
    number += 1
    console.log("Числа: ", number);
}

// #2 Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
console.log("!!!Друга задача!!!");
for (let i = 2; i <= 20; i += 2) {
    if (i % 2 !== 0) {
        continue;
    }
    console.log(`Парні числа: ${i}`);
}

// #3 Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
console.log("!!!Третя задача!!!");
for (let i = 1; i <= 10; i++) {
    console.log(`7 × ${i} = ${7 * i}`);
}

// #4 Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
console.log("!!!Четверта задача!!!");
const n = 20;

for (let i = 0; i < n; i += 1) {
    if (i === n) {
        break;
    }
    console.log(`Числа менші за n: ${i}`);
}

// #5 За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let firstNumber = 0;
const maxNumber = 20;

while (firstNumber < maxNumber) {
    firstNumber += 1;
    if (firstNumber % 3 === 0) {
        continue; 
    }
    console.log(firstNumber);
}



